app/Http/Controllers/OneToManyController.php

select * from `countries` limit 1
select * from `states` where `states`.`country_id` = '1' and `states`.`country_id` is not null
---
    public function storeOneToManyTwo()
    {
        $country = Country::first();
        $State = $country->states->first();

select * from `countries` limit 1
---
    public function oneToManyTwo()
    {
        $country = Country::first();